{
    "Header": {
        "NavLinks": {
            "landing": "Landing",
            "projects": "Projects",
            "roadMap": "Academics",
            "about": "About me"
        },
        "Actions": {
            "getInTouch": "Get In Touch"
        },
        "AltMessages": {
            "logo": "My personnal brand logo showing up the growth values I hold on to."
        }
    },
    "Footer": {
        "copyrightsLabel": "Copyrights",
        "authorLabel": "Designed and coded by"
    },
    "pages": {
        "home": {
            "heroSection": {
                "morningGreeting": "Morning",
                "eveningGreeting": "Evening",
                "introductionFormula": "I'm",
                "letMotiv": "Above all, technology must bring added value to the human experience and the planet and bring social interactions from sufficiency to excellence.",
                "tooltipLabels": {
                    "sendMail": "Send me an email",
                    "linkedInProfil": "Take a look at my profil",
                    "resume": "Download my resume",
                    "bitOfCode": "See a preview of my code"
                }
            },
            "technos": {
                "languages": "Languages",
                "frameworks": "Frameworks and Libraries",
                "services": "Backend services",
                "databases": "DataBases",
                "conception": "UX and UI processes",
                "integration": "Versioning and CI/CD",
                "others": "Others"
            },
            "socials": {
                "title": {
                    "hook": "Social experiences",
                    "main": "Volunteering and associations",
                    "description": "Apart from development and my academic career, I do a lot of extracurricular and volunteer activities. In order to be able to progress in different aspects."
                }
            },
            "container": {
                "titles": {
                    "domains": {
                        "hook": "interests",
                        "main": "Areas of expertise",
                        "description": "These areas, far from being exhaustive, represent the main sectors in which I have had prior experience. However, I remain very open to novelty and challenges."
                    },
                    "technos": {
                        "hook": "Skills",
                        "main": "TECHNOS & LANGUAGES",
                        "description": "This list is not exhaustive. It represents the main technologies with which I have already had to work. However, I am ready to adapt and improve my skills."
                    },
                    "experiences": {
                        "title": "Showcase",
                        "description": "I am very versatile in web and mobile application development, mastering the entire chain: needs analysis, UX design, creation of interactive mockups, development, testing, and automated deployment via CI/CD. I ensure the reliability and performance of solutions, using artificial intelligence to optimize and automate features. My comprehensive approach guarantees innovative, user-centric applications, with proactive monitoring and maintenance.", 
                        "positions": {
                            "headAtJunior": "Head of the UTBM Junior Studies Department",
                            "brindilles": "Volunteer for the organization of the young caregivers festival",
                            "workerAtJunior": "Study supervisor at Junior UTBM",
                            "afev": "Educational and social support worker"
                        },
                        "descriptions": {
                            "headAtJunior": "Supervise the overall progress of missions. Ensure the development of my colleagues. Ensure accurate reporting to management. Facilitate effective communication internally and externally. Actively contribute to strategic decisions and their implementation.",
                            "brindilles": "Welcome and supervise young people from 7 to 25 years old. Talk to them and make them smile. Prepare smoothies in a good mood. Do activities (games, competitions, karaoke, etc.). Be a good listener. Ensure the cleanliness of the stand. Guarantee the development of all participants.",
                            "workerAtJunior": "Ensure the smooth running of the missions assigned to me. Help write the specification (if necessary). Guarantee quality reporting to my hierarchy. Communicate effectively internally and externally. Ensure the quality of deliverables and compliance with deadlines.",
                            "afev": "Accompany children in their school activities to strengthen their understanding and learning. Stimulate their autonomy by encouraging them to solve problems independently. Support children in managing their emotions to improve their well-being and concentration."
                        }
                    }
                }
            }
        },
        "hire": {
            "title": {
                "hook": "Get in touch !",
                "main": "CONTACT FORM",
                "description": "I very much hope that my profile has aroused your interest.",
                "furtherDescription": "Please don't hesitate to send me a private message on one of my networks or directly on this website so that we can discuss things further."
            },
            "profilSection": {
                "requiredSkills": "Required skills",
                "skillErrorLabel": "Please select at least one skill.",
                "incentiveMessage": "It would be a real pleasure for me to work with you!"
            },
            "contactForm": {
                "steps": {
                    "first": "Introducing",
                    "second": "Contacts",
                    "third": "Mission"
                },
                "stepDescriptions": {
                    "first": "Please introduce yourself.",
                    "second": "Add at least one of your contacts.",
                    "third": "Brief description of the project."
                },
                "labels": {
                    "firstName": "First name",
                    "familyName": "Family name",
                    "company": "Company name",
                    "email": "e-mail address",
                    "phone": "Phone number",
                    "projectTitle": "Project title",
                    "projectDescription": "Project description"
                },
                "submitAnotherProject": "Submit another project",
                "successMessage": "Your proposal has been sent successfully. I will respond to it within 24 hours.",
                "nextStep": "Next",
                "previousStep": "Back",
                "submitProject": "Submit",
                "summary": {
                    "title": "Mission Proposal Summary",
                    "send": "Send",
                    "cancel": "Cancel"
                },
                "mailError": "Your proposal could not be sent!",
                "email": {
                    "emailHeader": "I would like to contact you to offer you a mission that matches your profile. We are currently looking for a speaker for a project entitled",
                    "projectDescriptionAnnouncer": "The project mainly consists of ",
                    "skillsAnnouncer": "For this mission, the essential skills are:",
                    "goodByeFormulation": "King regards"
                }
            },
            "companies": {
                "title": {
                    "hook": "Companies",
                    "main": "Companies I've worked with",
                    "description": "Some companies with which I collaborate or have had to collaborate on non-confidential projects"
                }
            }
        },
        "projects": {
            "projects": {
                "titles": {
                    "portfolio": "My portfolio 1st Version",
                    "africanTerroir": "E-commerce website by Terroir d'Afrique",
                    "movieGuidApp": "MovieAdvisor",
                    "stockManagement": "Inventory management platform by Bio-Gusta",
                    "ubuntu": "SJP Prom King and Queen Elections",
                    "otakuApp": "Otaku App",
                    "privateNight": "Validation Certificates: RSA Authentication",
                    "jsWindowTransfert": "DLR Soccers: Transfer window"
                },
                "descriptions": {
                    "portfolio": "This is a SPA coded in React. I describe myself and present my skills and the projects I have had to carry out. I also use Material UI for animations and interactions. The design is clean, modern and responsive. It also includes a contact form allowing recruiters to contact me directly through a messaging API integration.",
                    "africanTerroir": "This mission was carried out in its entirety (user research, process and user interface design, development of the web platform, testing and implementation) by us. Overall, the solution was similar to a classic e-commerce site (authentication, configuration and profile verification, purchases, delivery tracking, order history, management of item availability, user ratings and feedback, provision of local and international payment solutions, classic interactions with blog articles, etc.).",
                    "movieGuidApp": "It is a search platform dedicated to movies and series, designed to help users quickly form an opinion before choosing what to watch. By performing a simple search, the interface presents key details such as the title, other users' ratings, the full cast, the summary (plot), the duration, as well as the genres and subgenres. The goal is to provide a fluid and enriching experience, allowing moviegoers to consult all the necessary information in one place to make informed decisions about their next viewing sessions.",
                    "stockManagement": "This mission was carried out in its entirety (user research, process and user interface design, development of the web platform, testing and implementation) by us. Overall, the solution was similar to a classic e-commerce site (authentication, configuration and profile verification, purchases, delivery tracking, order history, management of item availability, user ratings and feedback, provision of local and international payment solutions, classic interactions with blog articles, etc.).",
                    "ubuntu": "Web platform dedicated to the election of the king and queen of our class, with a secure and transparent process. Students log in via their school email address, which is registered with the unique identifier of their device to guarantee a unique vote. Once their choice of candidates is made, the vote is locked, and they can only follow the evolution of the results in real time. At the scheduled time, the final podium is displayed, offering a fluid and engaging experience while ensuring the integrity of the vote.",
                    "otakuApp": "An immersive platform for anime fans, combining information and interactive features. Users can search for comprehensive details about their favorite anime, receive personalized recommendations based on their favorite genres, and place anime in a dedicated list to watch later. The platform offers regular reminders to follow this list, while offering fun quizzes to earn points and climb a competitive leaderboard, creating a dynamic and engaging community for anime enthusiasts.",
                    "privateNight": "Secure system allowing subscribers to access a resource protected by a keyword, which is regenerated every month. The platform uses a robust two-step authentication process: verification of the email and password pair, followed by verification of the terminal's IP address using an RSA-encrypted certificate. Once authenticated, the user gains access to the secret word. If a suspicious connection attempt is detected (same device or account reconnecting within the month), an intrusion alert is triggered, the keyword is immediately changed, and all verified devices receive a secure notification.",
                    "jsWindowTransfert": "Transfer market simulation interface, allowing users to manage their team by searching for players, applying filters and initiating negotiations for the acquisition of new talents. The interface allows dynamic transfer management, providing an immersive experience where the user can recruit the players that best fit the needs of his team, while simulating the strategic aspects of the market."
                }
            },
            "callToActionLabel": "Do you have an idea in mind ?",
            "callToActionButton": "Let's talk about it !"
        },
        "project": {
            "seeAllProjects": "See all projects",
            "viewProduct": "View the product",
            "examineCode": "See the code"
        },
        "notFound": {
            "message": "The ressource you're looking for is not available.",
            "backHome": "Back home",
            "previousPage": "Previous page"
        },
        "roadMap": {
            "titles": {
                "experience": {
                    "main": "My academic background",
                    "hook": "Education",
                    "description": "This section presents the vast majority of experiences I have had on the educational level. Whether on an individual basis (Mooc, BootCamps, Hackathons, etc.) in a classroom (universities, conferences, etc.) or during company stays (internships, visits, discovery days, etc.)."
                },
                "competences": {
                    "main": "Overview",
                    "hook": "Skills",
                    "description": "Here you will find the notable areas in which I have been able to develop a certain level of skills. As well as the estimation of this level."
                }
            },
            "timeline": {
                "highSchoolDiploma": "Baccalaureat",
                "permanentPosition": "Currently seeking a permanent position of engineer in full stack development, available from September 2025.",
                "lookingForInternship": "Looking for my final year project (6 months from February 2025)",
                "experiences": {
                    "titles": {
                        "ST50": "Graduation Project | Entry-Level Engineer",
                        "D4Gen": "D4Gen Hackathon | Digital genomics",
                        "A24": "Course semester (Artificial Intelligence)",
                        "P24": "Course semester (Software Engineering)",
                        "A23": "Assistant engineer internship at Ekilog",
                        "interA23": "Innovation Crunch Time: Mobility of industrial equipment",
                        "interA22": "Innovation Crunch Time: Green energy production",
                        "A3": "Core curriculum",
                        "uxCert": "Google User Experience Design Professional Certificate",
                        "elviatech": "Elviatech Olympics: exploratory robot",
                        "cpge": "Preparatory classes: MPSI"
                    },
                    "descriptions": {
                        "ST50": "As part of my final year project at Orange, I led a comprehensive DevOps initiative aimed at optimizing production deployment processes by developing a tailored internal tool. This individual project involved gathering and analyzing user needs, identifying shortcomings in the existing solution, and designing a more responsive and accessible alternative. From initial ideation to final deployment, I combined strategic thinking with hands-on technical execution to deliver a solution aligned with real operational challenges. The experience offered a deep dive into DevOps culture, where I honed my skills in automation, system reliability, and user-centered development. It also enhanced my ability to manage a complex project end-to-end within a large-scale industrial environment.",
                        "D4Gen": "During the D4Gen challenge, an innovation-focused event centered on artificial intelligence, I took on the role of TechLead within a multidisciplinary team. We worked on a project addressing mental health and cognitive decline, aiming to support specialists in patient monitoring and treatment. The tool we developed was designed to assist clinical decision-making through AI models and an intuitive user interface. This experience allowed me to coordinate efforts across development, data science, AI, and UI design, fostering rapid and creative collaboration around a significant societal challenge.",
                        "A24": "This UTBM business block trains engineers specializing in the fields of multiagent systems, optimization and machine learning. Students learn to design intelligent systems where multiple agents interact to solve complex problems. They also develop skills in mathematical optimization to improve the performance of algorithms and in the application of machine learning, particularly to process large volumes of data (Big Data). The program emphasizes practical projects that allow students to deploy solutions in robotics and in industrial contexts, while preparing them to adapt to rapid technological developments.",
                        "P24": "The Software Deployment Methods and Tools business block at UTBM specializes in the design and deployment of large-scale applications. Students acquire essential technical skills to implement software in complex environments, while respecting strict quality and efficiency requirements. The tools covered in this course cover project management methods, continuous integration and automated testing, as well as the optimization of development processes to ensure smooth and sustainable production of software solutions.",
                        "A23": "Ekilog is a startup that develops innovative IT solutions, specialized in the SharePoint ecosystem, to help companies improve their collaboration and productivity, while offering tailor-made services to support digital transformation. As an assistant engineer, I participated in the development of SharePoint solutions by working on the functional analysis of new features. I contributed to the technical design by developing specific components via SharePoint Framework (SPFx) and participated in the testing and validation phases to ensure the quality of the deliverables. Finally, I collaborated with the Lead Developer to finalize the modules and ensure their smooth integration into the product range. This internship allowed me to develop technical skills in front-end development and project management in a collaborative environment.",
                        "interA23": "During this XXL ideation and prototyping exercise, I participated in an intensive innovation sprint where we worked as a team to design innovative solutions to address mobility challenges in the industrial sector. This project allowed us to combine technical skills and creativity to develop prototypes aimed at improving the efficiency and flexibility of equipment used in production and logistics. The experience focused on rapid collaboration, time management and complex problem solving, all in a stimulating environment focused on industrial performance and process optimization.",
                        "interA22": "I participated in the CrunchTime on the theme of green energy production, an ideation challenge where the objective was to design innovative solutions for the production and optimization of renewable energies. As a team, we explored technologies and strategies to make energy production more sustainable, with a focus on the integration of clean energy sources such as solar, wind and tidal energy. This challenge allowed me to strengthen my skills in project management, teamwork and strategic thinking, while developing a better understanding of the environmental and technological issues related to green energy.",
                        "A3": "The core curriculum at UTBM offers a general education in science and technology, reinforced by industrial projects and internships in companies. This common core allows students to acquire solid skills in mathematics, physics, computer science, and engineering sciences, while promoting international openness. After these first two years, students specialize in one of the nine proposed courses, according to their interests. This approach guarantees a successful transition to engineering careers in innovative and constantly evolving sectors.",
                        "uxCert": "This course helped me develop practical skills in user experience (UX) design through key concepts and tools for creating user-centered interfaces. I learned how to use user stories to define user needs and create user flows to map out their journey. The course also introduced me to creating wireframes and interactive prototypes to visualize and test design ideas before development. Additionally, I gained experience in user research to gather feedback and improve designs, as well as using personas and user boards to better target user expectations. This approach provided me with a deep understanding of the UX design process, from ideation to final product validation.",
                        "elviatech": "I participated in the ELVIA TECH Hackathon, an ideation challenge organized in Central Africa, focused on Artificial Intelligence and robotics. The application domain we chose was the explorer robot. Our team worked on designing an autonomous robot capable of exploring complex environments, integrating AI technologies for real-time data processing, navigation, and trajectory optimization. This project allowed me to enhance my skills in AI, robotics, and teamwork to solve advanced technical challenges.",
                        "cpge": "The Preparatory Classes (CPGE) is a highly intensive two-year program designed to prepare students for competitive entrance exams to prestigious engineering or business schools in France. It offers a rigorous curriculum focused on developing a strong foundation in mathematics, physics, chemistry, engineering sciences, or economics and languages, depending on the chosen track. The CPGE emphasizes analytical thinking, problem-solving skills, and methodological rigor. It also fosters stress management and teamwork, equipping students with the discipline and resilience needed to excel in demanding academic and professional environments."
                    }
                }
            }
        },
        "about": {
            "studentStatus": "Engineering student",
            "workStatus": "FullStack Web and Mobile Developer.",
            "description": {
                "firstSection": "A passionate developer driven by innovation, I specialize in mobile, web, and software development with a strong focus on creativity and user-centered design. My goal is to create intuitive and impactful solutions that enhance users' daily lives in meaningful and sustainable ways.",
                "secondSection": "Curious and forward-thinking, I continually explore emerging technologies such as IoT and artificial intelligence to develop smart, connected applications. I thrive on projects that bring genuine added value, combining innovation, resource optimization, and environmental consciousness.",
                "thirdSection": "I am motivated by the challenge of developing engaging experiences that place people at the heart of technology, while contributing to a more sustainable world. For me, each project is an opportunity to push boundaries and deliver practical, responsible solutions."
            }
        }
    },
    "general": {
        "selectLanguageTool": "Change the language",
        "hireMeLabel": "Hire me",
        "seeMyProjects": "See my projects",
        "skills": {
            "uxDesigner": "UX designer",
            "frontendDeveloper": "Frontend developer",
            "backendDeveloper": "Backend developer",
            "fullStackDeveloper": "Fullstack developer"
        },
        "domains": {
            "mobileDev": "Mobile Development",
            "webDev": "Web Development",
            "concepUX": "UX & UI Conception",
            "aiTools": "Artificial Intelligence"
        },
        "description": {
            "mobileDev": "Mobile development is about creating elegant, high-performance applications that integrate seamlessly into our daily lives, delivering optimized and intuitive experiences that transform smartphones into essential tools.",
            "webDev": "Web development transforms abstract concepts into engaging digital experiences, combining creativity and technical rigor to design dynamic platforms that connect and inspire millions of people.",
            "concepUX": "UI/UX design shapes intuitive and captivating user experiences, perfectly balancing aesthetics, learning rate and usability to make every interaction with technology enjoyable, simple and memorable.",
            "aiTools": "Artificial intelligence harnesses the power of data to create intelligent, revolutionary and self-learning solutions, redefining the way we interact with technology and improving every aspect of our daily lives."
        },
        "status": {
            "inProgress": "In Progress",
            "done": "Done"
        },
        "keywords": {
            "description": "Description",
            "stack": "Stack",
            "pronoun": "he",
            "connector": "and",
            "nowIndicator": "Now"
        }
    }
}